---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.PolygonSegmentTooShort
source: html/68ac67c4-ed50-e442-0ea1-9e04a98d1266.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.PolygonSegmentTooShort Property

Polygon segment too short

## Syntax (C#)
```csharp
public static FailureDefinitionId PolygonSegmentTooShort { get; }
```